---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetDefaultConnectionHandlerType(Autodesk.Revit.DB.Document)
source: html/f9b606a4-2656-dca7-8f8e-469630bd151e.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.GetDefaultConnectionHandlerType Method

Gets a default type id for Structural Connection.

## Syntax (C#)
```csharp
public static ElementId GetDefaultConnectionHandlerType(
	Document pADoc
)
```

## Parameters
- **pADoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The type id.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null